CREATE TABLE IF NOT EXISTS test_crub (
  id INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY
);

Добавил столбцов

ALTER TABLE test_crub ADD COLUMN company VARCHAR(100) DEFAULT NULL;
ALTER TABLE test_crub ADD COLUMN address VARCHAR(100) DEFAULT NULL;
ALTER TABLE test_crub ADD COLUMN type VARCHAR(100) DEFAULT NULL;
ALTER TABLE test_crub ADD COLUMN created_at DATETIME NOT NULL;

Поменял тип даты создания
ALTER TABLE test_crub MODIFY COLUMN created_at DATETIME DEFAULT NOW();

INSERT INTO test_crub VALUES 
  (DEFAULT, 'Ромашка', 'Ленина', 'ИП', DEFAULT),
  (DEFAULT, 'Рога и копыта', 'Парковая', DEFAULT, DEFAULT),
  (DEFAULT, 'Заноза', 'Ленина', 'ЗАО', DEFAULT),
  (DEFAULT, 'Заноза', 'Виноградная', 'ООО', DEFAULT);

Провел эксперимантик небольшой.
втавил название компании по умолчанию.

INSERT INTO test_crub VALUES (DEFAULT, DEFAULT, 'Пирогова', 'ИП', DEFAULT),


Хотел сменить тип имени, выдала ошибку. Видимо из за наличия в таблице значения NULL в поле company.
ALTER TABLE test_crub MODIFY COLUMN company VARCHAR(100) NOT NULL;

Удалил сторку со значенияем NULL в поле company

DELETE FROM test_crub WHERE company is NULL;
После удаления изменить тип получилось.


Вместо DEFAULT применил NULL
INSERT INTO test_crub VALUES (NULL, 'Связной', NULL, NULL, NULL);


INSERT INTO test_crub (company, type) VALUES ('Евросеть', 'ЗАО');
INSERT INTO test_crub (company) VALUES ('Ikea');

Изменил еще раз тип данных company

ALTER TABLE test_crub MODIFY COLUMN company VARCHAR(100) NOT NULL UNIQUE;

получил ошибкe из за уже имеющихся дубликатов
таблица сейчас такая
| id | company                     | address                | type   | created_at          |
+----+-----------------------------+------------------------+--------+---------------------+
|  1 | Ромашка                     | Ленина                 | ИП     | 2019-09-19 08:21:57 |
|  2 | Ромашка                     | Ленина                 | ИП     | 2019-09-19 08:25:18 |
|  3 | Рога и копыта               | Парковая               | NULL   | 2019-09-19 08:25:18 |
|  4 | Заноза                      | Ленина                 | ЗАО    | 2019-09-19 08:25:18 |
|  5 | Заноза                      | Виноградная            | ООО    | 2019-09-19 08:25:18 |
|  7 | Золотой ключик              | Пушкина                | ПАО    | NULL                |
|  8 | Золотой ключик              | Пушкина                | ПАО    | NULL                |
|  9 | Золотой ключик              | NULL                   | NULL   | NULL                |
| 10 | Золотой ключик              | Солнечная              | ИП     | 2019-09-19 09:30:42 |
| 11 | Связной                     | NULL                   | NULL   | NULL                |
| 12 | Евросеть                    | NULL                   | ЗАО    | 2019-09-19 09:34:12 |
| 13 | Ikea                        | NULL                   | NULL   | 2019-09-19 09:34:43 |
+----+-----------------------------+------------------------+--------+---------------------

Удалил сторки с 1, 5, 8,9,10 id

DELETE FROM test_crub WHERE id in (1, 5, 8, 9, 10);


еще раз добавил

INSERT INTO test_crub VALUES 
  (DEFAULT, 'Ромашка', 'Ленина', 'ИП', DEFAULT),
  (DEFAULT, 'Рога и копыта', 'Парковая', DEFAULT, DEFAULT),
  (DEFAULT, 'Заноза', 'Ленина', 'ЗАО', DEFAULT),
  (DEFAULT, 'Заноза', 'Виноградная', 'ООО', DEFAULT);


SELECT company, address from test_crub;
+-----------------------------+------------------------+
| company                     | address                |
+-----------------------------+------------------------+
| Ромашка                     | Ленина                 |
| Рога и копыта               | Парковая               |
| Заноза                      | Ленина                 |
| Золотой ключик              | Пушкина                |
| Связной                     | NULL                   |
| Евросеть                    | NULL                   |
| Ikea                        | NULL                   |
| Ромашка                     | Ленина                 |
| Рога и копыта               | Парковая               |
| Заноза                      | Ленина                 |
| Заноза                      | Виноградная            |
+-----------------------------+------------------------+

SELECT DISTINCT * from test_crub;


+-----------------------------+------------------------+
| company                     | address                |
+-----------------------------+------------------------+
| Ромашка                     | Ленина                 |
| Рога и копыта               | Парковая               |
| Заноза                      | Ленина                 |
| Золотой ключик              | Пушкина                |
| Связной                     | NULL                   |
| Евросеть                    | NULL                   |
| Ikea                        | NULL                   |
| Заноза                      | Виноградная            |
+-----------------------------+------------------------+

имеется такая таблица

+----+-----------------------------+------------------------+--------+---------------------+
| id | company                     | address                | type   | created_at          |
+----+-----------------------------+------------------------+--------+---------------------+
|  2 | Ромашка                     | Ленина                 | ИП     | 2019-09-19 08:25:18 |
|  3 | Рога и копыта               | Парковая               | NULL   | 2019-09-19 08:25:18 |
|  4 | Заноза                      | Ленина                 | ЗАО    | 2019-09-19 08:25:18 |
|  7 | Золотой ключик              | Пушкина                | ПАО    | NULL                |
| 11 | Связной                     | NULL                   | NULL   | NULL                |
| 12 | Евросеть                    | NULL                   | ЗАО    | 2019-09-19 09:34:12 |
| 13 | Ikea                        | NULL                   | NULL   | 2019-09-19 09:34:43 |
| 14 | Ромашка                     | Ленина                 | ИП     | 2019-09-19 09:41:58 |
| 15 | Рога и копыта               | Парковая               | NULL   | 2019-09-19 09:41:58 |
| 16 | Заноза                      | Ленина                 | ЗАО    | 2019-09-19 09:41:58 |
| 17 | Заноза                      | Виноградная            | ООО    | 2019-09-19 09:41:58 |
| 18 | Зверьки                     | Ленина                 | ИП     | 2019-09-19 09:51:42 |
| 19 | Рога и копыта               | Парковая               | NULL   | NULL                |
| 20 | Obi                         | Липовая                | ЗАО    | NULL                |
| 21 | Заноза                      | Заречная               | ООО    | 2019-09-19 09:51:42 |
+----+-----------------------------+------------------------+--------+---------------------+


Удалил строки с пустым адресом и не пустым временем создания
DELETE FROM test_crub WHERE address IS NULL and created_at IS NOT  NULL;

+----+-----------------------------+------------------------+--------+---------------------+
| id | company                     | address                | type   | created_at          |
+----+-----------------------------+------------------------+--------+---------------------+
|  2 | Ромашка                     | Ленина                 | ИП     | 2019-09-19 08:25:18 |
|  3 | Рога и копыта               | Парковая               | NULL   | 2019-09-19 08:25:18 |
|  4 | Заноза                      | Ленина                 | ЗАО    | 2019-09-19 08:25:18 |
|  7 | Золотой ключик              | Пушкина                | ПАО    | NULL                |
| 11 | Связной                     | NULL                   | NULL   | NULL                |
| 14 | Ромашка                     | Ленина                 | ИП     | 2019-09-19 09:41:58 |
| 15 | Рога и копыта               | Парковая               | NULL   | 2019-09-19 09:41:58 |
| 16 | Заноза                      | Ленина                 | ЗАО    | 2019-09-19 09:41:58 |
| 17 | Заноза                      | Виноградная            | ООО    | 2019-09-19 09:41:58 |
| 18 | Зверьки                     | Ленина                 | ИП     | 2019-09-19 09:51:42 |
| 19 | Рога и копыта               | Парковая               | NULL   | NULL                |
| 20 | Obi                         | Липовая                | ЗАО    | NULL                |
| 21 | Заноза                      | Заречная               | ООО    | 2019-09-19 09:51:42 |
+----+-----------------------------+------------------------+--------+---------------------+

Удалил строки созданные в 8 часов
DELETE FROM test_crub WHERE HOUR(created_at) =08;


+----+-----------------------------+------------------------+--------+---------------------+
| id | company                     | address                | type   | created_at          |
+----+-----------------------------+------------------------+--------+---------------------+
|  7 | Золотой ключик              | Пушкина                | ПАО    | NULL                |
| 11 | Связной                     | NULL                   | NULL   | NULL                |
| 14 | Ромашка                     | Ленина                 | ИП     | 2019-09-19 09:41:58 |
| 15 | Рога и копыта               | Парковая               | NULL   | 2019-09-19 09:41:58 |
| 16 | Заноза                      | Ленина                 | ЗАО    | 2019-09-19 09:41:58 |
| 17 | Заноза                      | Виноградная            | ООО    | 2019-09-19 09:41:58 |
| 18 | Зверьки                     | Ленина                 | ИП     | 2019-09-19 09:51:42 |
| 19 | Рога и копыта               | Парковая               | NULL   | NULL                |
| 20 | Obi                         | Липовая                | ЗАО    | NULL                |
| 21 | Заноза                      | Заречная               | ООО    | 2019-09-19 09:51:42 |
+----+-----------------------------+------------------------+--------+---------------------+

select * from test_crub LIMIT 2;
+----+-----------------------------+----------------+--------+------------+
| id | company                     | address        | type   | created_at |
+----+-----------------------------+----------------+--------+------------+
|  7 | Золотой ключик              | Пушкина        | ПАО    | NULL       |
| 11 | Связной                     | NULL           | NULL   | NULL       |
+----+-----------------------------+----------------+--------+------------+


немного еще повставлял
INSERT INTO test_crub SET company = 'МВЗ';
INSERT INTO test_crub (company) VALUES ('ВАЗ'), ('УАЗ'), ('ГАЗ'),('КАМАЗ');
INSERT INTO test_crub VALUES 
  (DEFAULT, 'Ромашка', 'Ленина', 'ИП', DEFAULT),
  (DEFAULT, 'Рога и копыта', 'Парковая', DEFAULT, DEFAULT),
  (DEFAULT, 'Заноза', 'Ленина', 'ЗАО', DEFAULT),
  (DEFAULT, 'Заноза', 'Виноградная', 'ООО', DEFAULT);

Уалил все
DELETE FROM target_types;
Вставил новую запись, получил следующий id
select * from test_crub;
+----+----------------+--------------+------+---------------------+
| id | company        | address      | type | created_at          |
+----+----------------+--------------+------+---------------------+
| 35 | Ромашка        | Ленина       | ИП   | 2019-09-19 10:12:19 |
+----+----------------+--------------+------+---------------------+

и транканул

TRUNCATE test_crub;
Добавил запись. id пошел с единицы
select * from test_crub;
+----+----------------+--------------+------+---------------------+
| id | company        | address      | type | created_at          |
+----+----------------+--------------+------+---------------------+
|  1 | Ромашка        | Ленина       | ИП   | 2019-09-19 10:14:14 |
+----+----------------+--------------+------+---------------------+

DROP TABLE test_crub;
DROP TABLE test_crub;

Виктор что лучше работает на большом кол-ве строк? если на нашем примере:
SELECT DISTINCT company, address FROM test_crub;
или
SELECT  company, address FROM test_crub
 GROUP BY company, address;

